window.PORTRAY = {
  xg: {
    0: { label: "塑造0（默认）", desc: "无塑造强化" },
    1: { label: "塑造1", desc: "【自动写作法】释放至终的仪式时，获得【筹备·虚构集】的层数上限提升至2" },
    2: { label: "塑造2", desc: "【下现实主义迷宫】消耗【独白】/【群像】额外造成的现实创伤提升至70/35%" },
    3: { label: "塑造3", desc: "【下现实主义迷宫】造成的现实创伤提升至550/550%" },
    4: { label: "塑造4", desc: "【词的意象】在咒语1/2/3阶时，造成的现实创伤提升至150/225/375%，赋予的【独白】/【群像】层数提升至10" },
    5: { label: "塑造5", desc: "【下现实主义迷宫】造成的现实创伤提升至650/650%，每额外消耗1点激情提升的仪式威力提升至6%" }
  },
  mld: {
    0: { label: "塑造0（默认）", desc: "无塑造强化" },
    1: { label: "塑造1", desc: "【将过往摧毁】在咒语1/2/3阶时，造成的现实创伤提升至150/225/375%，【连续行动Ⅰ】持续回合数提升至2" },
    2: { label: "塑造2", desc: "【致“家人”】【战备部署】至终的仪式造成伤害提升至2.5%，【武装整修】暴击率提升至40%" },
    3: { label: "塑造3", desc: "【致“家人”】反击后，使自身激情增加提升至2" },
    4: { label: "塑造4", desc: "【不再迷失的归途者】造成的现实创伤提升至500%，使己方全体获得【礼仪：暴击创伤】层数提升至8" },
    5: { label: "塑造5", desc: "【不再迷失的归途者】若主动释放，额外对敌方全体造成现实创伤提升至600%，【教条】仪式威力提升至30%" }
  },
  ran: {
    0: { label: "塑造0（默认）", desc: "无塑造强化" },
    1: { label: "塑造1", desc: "【驯鹰女巫】进入战斗时，使自身激情增加提升至5；【悄冥冥术阵】【群鸟之歌】术法威力提升至45%，仪式威力提升至45%" },
    2: { label: "塑造2", desc: "【驯鹰女巫】进入战斗时，【使役通感】注入的能量提升至85%；【默契同调】被消耗时，【使役通感】注入的能量提升至10%，自身获得的【灵犀】层数提升至3，【灵犀】叠加上限提升至7层；每层【灵犀】使己方克制伤害系数提升至5%；【虫虫黑莓唤回术】造成的精神创伤提升至3000%，每拥有1层【灵犀】，额外造成的精神创伤提升至300%" },
    3: { label: "塑造3", desc: "【加护】使【囫囵囵咒】新增的暴击防御降低提升至20%，每层【灵犀】额外降低的暴击防御最多降低至21%；使【悄冥冥术阵】新增的创伤加成提升至20%，每层【灵犀】额外提升的创伤加成最多额外提升至21%" },
    4: { label: "塑造4", desc: "【唱予无忧之诗】【尘酿鹰】攻击转化率提升至10%，上限提升至310；最大生命转化率提升至10%，上限提升至1550" },
    5: { label: "塑造5", desc: "【驯鹰女巫】每回合开始时，使自身获得的【灵犀】层数提升至2；进入战斗时，【使役通感】注入的能量提升至100%；【默契同调】被消耗时，【使役通感】注入的能量提升至12.5%，自身获得的【灵犀】层数提升至4，【灵犀】叠加上限提升至10层；【虫虫黑莓唤回术】造成的精神创伤提升至5000%，每拥有1层【灵犀】，额外造成的精神创伤提升至500%" }
  },
  j: {
    0: { label: "塑造0（默认）", desc: "无塑造强化" },
    1: { label: "塑造1", desc: "【热处理】【高温回火】造成现实创伤提升至40%，每损失10%生命额外造成的现实创伤提升至15%" },
    2: { label: "塑造2", desc: "【此身为炉膛】攻击提升效果提升至自身【燃烧】层数*1%" },
    3: { label: "塑造3", desc: "【此身为炉膛】自身携带【燃烧】上限提升至45层" },
    4: { label: "塑造4", desc: "【飞跃海特街！】造成现实创伤提升至450%，每溢出1层【燃烧】额外造成的现实创伤提升至15%" },
    5: { label: "塑造5", desc: "【此身为炉膛】攻击提升效果提升至自身【燃烧】层数*1.5%" }
  }
};
